-- MySQL dump 10.13  Distrib 8.0.20, for Win64 (x86_64)
--
-- Host: localhost    Database: mydb
-- ------------------------------------------------------
-- Server version	8.0.20

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!50503 SET NAMES utf8 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `sys_function`
--

DROP TABLE IF EXISTS `sys_function`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `sys_function` (
  `FunctionId` int NOT NULL AUTO_INCREMENT,
  `F_Desc` varchar(50) CHARACTER SET utf8 COLLATE utf8_general_ci DEFAULT NULL,
  `F_Enable` int NOT NULL,
  `F_ModuleId` int NOT NULL,
  `F_Name` varchar(20) CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL,
  `F_Value` int NOT NULL,
  PRIMARY KEY (`FunctionId`),
  UNIQUE KEY `sys_Function_ix1` (`F_ModuleId`,`F_Value`),
  UNIQUE KEY `sys_Function_ix2` (`F_ModuleId`,`F_Name`)
) ENGINE=InnoDB AUTO_INCREMENT=169 DEFAULT CHARSET=utf8;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `sys_function`
--

LOCK TABLES `sys_function` WRITE;
/*!40000 ALTER TABLE `sys_function` DISABLE KEYS */;
INSERT INTO `sys_function` VALUES (1,'查看',1,2,'查看模块',1),(2,'查看',1,2,'查看应用',32),(3,'删除',0,2,'删除模块',8),(4,'删除',0,2,'删除应用',256),(5,'添加顶级模块',1,2,'添加顶级模块',16),(6,'添加',1,2,'添加子模块',2),(7,'添加',1,2,'添加应用',64),(8,'修改',1,2,'修改模块',4),(9,'修改',1,2,'修改应用',128),(10,'查看',1,48,'查看角色用户',1),(11,'移除',1,48,'移除角色用户',8),(12,'添加',1,48,'添加角色用户',2),(13,'修改',1,48,'修改角色用户',4),(14,'查看',1,10,'查看角色应用',1),(18,'添加',1,10,'添加角色应用',2),(19,'修改',1,10,'修改角色应用',4),(20,'删除',1,10,'删除角色应用',8),(22,'权限',1,10,'设置应用权限',16),(23,'审核不通过',1,23,'审核不通过',1),(24,'查看',1,11,'查看用户',1),(25,'添加',1,11,'添加用户',2),(26,'编辑',1,11,'修改用户',4),(28,'删除',0,11,'删除用户',8),(29,'查看',1,48,'查看角色',16),(30,'添加',1,48,'添加角色',32),(31,'修改',1,48,'修改角色',64),(32,'删除',1,48,'删除角色',128),(33,'查看',1,61,'查看功能',1),(34,'添加',1,61,'添加功能',2),(35,'修改',1,61,'修改功能',4),(36,'删除',0,61,'删除功能',8),(40,'查看',1,6,'查看日志',1),(41,'删除',1,6,'删除日志',8),(42,'查看',1,4,'查看字段',1),(43,'添加',1,4,'添加字段',2),(44,'修改',1,4,'修改字段',4),(45,'删除',0,4,'删除字段',8),(46,'查看',1,12,'查看数据字段',1),(47,'添加',1,12,'添加数据字段',2),(48,'修改',1,12,'修改数据字段',4),(49,'删除',1,12,'删除数据字段',8),(50,'查看',1,8,'查看行政区',1),(51,'添加',1,8,'添加子级行政区',2),(52,'修改',1,8,'修改行政区',4),(53,'删除',0,8,'删除行政区',8),(54,'添加顶级行政区（省）',1,8,'添加顶级行政区',16),(55,'查看',1,9,'查看单位部门',1),(56,'添加',1,9,'添加子部门',2),(57,'修改',1,9,'修改单位部门',4),(58,'删除',1,9,'删除单位部门',8),(59,'添加顶级单位部门',1,9,'添加顶级单位部门',16),(60,'重置密码',1,11,'重置密码',16),(61,'移除本角色下所有用户',1,48,'移除所有用户',256),(62,'查看',1,26,'查看',1),(63,'保存',1,14,'保存',1),(65,'导出Excel',1,8,'导出Excel',32),(66,'导出Excel',1,9,'导出Excel',32),(67,'全部导出Excel',1,24,'全部导出Excel',1),(68,'查看',1,25,'查看',1),(69,'查看',1,42,'查看',1),(70,'查看',1,27,'查看',1),(71,'查看',1,39,'查看',1),(72,'导出Excel',1,40,'导出Excel',2),(73,'导出Excel',1,29,'导出Excel',1),(74,'导出Excel',1,30,'导出Excel',1),(75,'导出Excel',1,62,'导出Excel',1),(76,'查看',1,32,'查看',1),(77,'查看',1,33,'查看',1),(78,'查看',1,63,'查看',1),(79,'查看',1,14,'查看',2),(80,'导出Excel',1,37,'导出Excel',1),(81,'是否可选网络视频',1,70,'是否可选网络视频',128),(82,'添加用户车站',1,65,'添加用户车站',1),(83,'上传视频',1,66,'上传视频',1),(84,'发布文本通知',1,68,'发布文本通知',1),(85,'发布图片通知',1,69,'发布图片通知',1),(88,'会员资料审核（绑定车辆所属单位）',1,35,'审核',2),(89,'所选的资料审核不通过',1,35,'审核不通过',4),(90,'重置密码',1,37,'重置密码',2),(91,'打回，重新审核',1,35,'打回',8),(92,'审核通过',1,23,'审核通过',2),(93,'打回',1,23,'打回',4),(94,'播放视频',1,66,'播放',2),(95,'删除视频',1,66,'删除',4),(96,'按查询结果导出Excel',1,24,'按查询结果导出Excel',2),(97,'发布检票班次通知',1,72,'发布检票班次通知',1),(99,'查看',1,13,'查看',1),(100,'会员资料审核（绑定车辆所属单位）',1,35,'注销',1),(101,'发布视频通知',1,70,'发布视频通知',1),(102,'清空列表',1,71,'清空列表',1),(103,'导出Excel',1,32,'导出Excel',2),(104,'导出Excel',1,33,'导出Excel',2),(105,'导出Excel',1,63,'导出Excel',2),(106,'是否可选本地视频',1,70,'是否可选本地视频',256),(107,'清空播放列表',1,68,'清空播放列表',2),(108,'发送欢迎标语',1,74,'发送欢迎标语',1),(109,'发送升级命令',1,75,'发送升级命令',1),(110,'发送高级命令',1,76,'发送高级命令',1),(111,'批量设置为滚动线路',1,77,'批量设置为滚动线路',1),(112,'撤销滚动',1,26,'撤销滚动',2),(117,'查看',1,79,'查看',1),(118,'导出Excel',1,79,'导出Excel',2),(119,'查看',1,80,'查看',1),(120,'导出Excel',1,80,'导出Excel',2),(123,'查询',1,82,'fasfsa',1),(124,'导出Excel',1,82,'导出Excel',2),(125,'导出Excel',1,83,'导出Excel',2),(126,'查看',1,83,'查看',1),(127,'删除全部视频',1,66,'全部删除',32),(128,'查看',1,84,'查看',1),(129,'导出Excel',1,84,'导出Excel',4),(130,'导出Excel',1,38,'导出Excel',4),(131,'重置密码',1,38,'重置密码',32),(132,'添加子单位',1,37,'添加子单位',8),(133,'添加顶级区域线',1,85,'添加顶级区域线',4),(134,'添加子线',1,85,'添加子线',16),(135,'编辑',1,85,'编辑区域线',32),(136,'删除',1,85,'删除区域线',64),(137,'查看',1,85,'查看',1),(138,'添加滚动线路',1,85,'添加滚动线路',128),(139,'查看',1,86,'查看',1),(140,'添加区域线的滚动线路',1,86,'添加区域线的滚动线路',2),(141,'解除绑定',1,86,'解除绑定',8),(142,'导出Excel',1,39,'导出Excel',2),(143,'查看',1,87,'查看',1),(144,'导出Excel',1,87,'导出Excel',2),(145,'导出Excel',1,89,'导出Excel',8),(146,'导出Excel',1,89,'线路详情导出Excel',16),(147,'导出Excel',1,89,'线路结算单详情导出Excel',32),(148,'查看',1,88,'查看',1),(149,'更改',1,88,'更改结算单',2),(150,'导出Excel',1,74,'统计线详情导出Excel',4),(152,'查看',1,90,'查看',1),(153,'批量通过核对',1,90,'批量通过核对',16),(154,'批量撤销核对',1,90,'批量撤销核对',32),(157,'清空播放列表',1,69,'清空播放列表',2),(158,'清空播放列表',1,70,'清空播放列表',2),(159,'删除该用户的车站',1,65,'删除',2),(160,'编辑用户车站',1,65,'编辑',8),(161,'刷新列表',1,71,'刷新列表',2),(162,'清除',1,71,'清除',4),(166,'zvzxv',1,82,'aaaabbb',16),(167,'zvxvzvz',1,82,'xxx22',32),(168,'vzv',1,82,'ccccxxx',64);
/*!40000 ALTER TABLE `sys_function` ENABLE KEYS */;
UNLOCK TABLES;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2020-09-24 17:52:37
